//========================================
//
// 障害物(石)の処理[obstacleStone.cpp]
// Author：小原立暉
//
//========================================
#include "obstacleStone.h"

//========================================
//名前空間
//========================================
namespace
{

}

//========================================
//コンストラクタ
//========================================
CObstacleStone::CObstacleStone() : CObstacle()
{//値をクリア
}

//========================================
//デストラクタ
//========================================
CObstacleStone::~CObstacleStone()
{
}

//========================================
// 初期化
//========================================
HRESULT CObstacleStone::Init(const EType type)
{
	if (FAILED(CObstacle::Init()))
	{ // 初期化処理に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	return S_OK;
}

//========================================
// 終了
//========================================
void CObstacleStone::Uninit(void)
{
	// 終了
	CObstacle::Uninit();
}

//========================================
// 更新
//========================================
void CObstacleStone::Update(void)
{
	// 更新
	CObstacle::Update();
}

//========================================
// 描画
//========================================
void CObstacleStone::Draw(void)
{
	// 描画
	CObstacle::Draw();
}
